Validation/VerticalFilm/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Numerical simulation of bubble growth in film boiling using a coupled
//level-set and volume-of-fluid method
//Autors: G. Tomar and etc

// for critical water at near critical pressure Pr=0.99



phaseChangeTwoPhaseMixture Hardt;

pSat             pSat       [1 -1 -2 0 0 0 0]   21.9E6;
       			 	
TSat		TSat	    [0 0 0 1 0]		646;//add saturation temprature

R               R   	    [0 2 -2 -1 0 0 0]   461.0; //add

TSatLocal       false;

Hfg		Hfg	[0 2 -2 0 0] 276.4e03;//add  J/kg

sigma           sigma [1 0 -2 0 0 0 0] 0.07e-03;

phase1
{
    transportModel Newtonian;
    nu              nu  [0 2 -1 0 0 0 0]    1.16e-07; //46.7e-6/402.4
    rho             rho [1 -3 0 0 0 0 0]    402.4;
    C		    C   [0 2 -2 -1 0 0 0]   2.18e5;//add
    K		    K   [1 1 -3 -1 0 0 0]   0.545;//add
}

phase2
{
    transportModel Newtonian;
    nu              nu  [0 2 -1 0 0 0 0]   1.92E-07;//1.33e-07;//32.38e-6/242.7
    rho             rho [1 -3 0 0 0 0 0]   242.7;
    C		    C   [0 2 -2 -1 0 0 0]  3.52e5;//look
    K		    K   [1 1 -3 -1 0 0 0]  0.538;//add
}

HardtCoeffs
{
   Cv            Cv   [0 0 0 0 0 0 0]    1; 
   rv            rv   [0 0 0 0 0 0 0]    0;
   rc            rc   [0 0 0 0 0 0 0]    1; 
}

LeeCoeffs
{
  rv            rv   [0 0 -1 0 0 0 0]    0;
  rc            rc   [0 0 -1 0 0 0 0]    1E7; 
}

FourierCoeffs {}
// ************************************************************************* //
